# SetLoadClassifications Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PanelScheduleData..::..SetLoadClassifications Method
PanelScheduleData Class See Also
---
Sets the Load Classifications associated with this panel schedule
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void SetLoadClassifications(
	IList<ElementId> loadClassificaions
)
```

Visual Basic
---
```text
Public Sub SetLoadClassifications ( _
	loadClassificaions As IList(Of ElementId) _
)
```

Visual C++
---
```text
public:
void SetLoadClassifications(
	IList<ElementId^>^ loadClassificaions
)
```

# ### Parameters
loadClassificaions
    Type: System.Collections.Generic..::..IList<(Of <(<'ElementId>)>)> The load classifications to assign
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace